export const rolesData = [
  {
    id: 1,
    name: "المدير العام",
    description: "يمتلك صلاحيات كاملة على النظام.",
    permissions: [
      "إدارة المستخدمين",
      "إدارة المنتجات",
      "إدارة الطلبات",
      "عرض التقارير",
      "تغيير الإعدادات",
      "إدارة الفواتير",
      "إدارة التصنيفات",
    ],
  },
  {
    id: 2,
    name: "مدير المنتجات",
    description: "صلاحيات لإدارة المنتجات والتصنيفات.",
    permissions: ["إدارة المنتجات", "إدارة التصنيفات"],
  },
  {
    id: 3,
    name: "مدير الطلبات",
    description: "صلاحيات لإدارة الطلبات والفواتير.",
    permissions: ["إدارة الطلبات", "إدارة الفواتير"],
  },
  {
    id: 4,
    name: "محرر محتوى",
    description: "صلاحيات محدودة لتحرير المحتوى.",
    permissions: ["عرض المنتجات", "تعديل وصف المنتجات"],
  },
  {
    id: 5,
    name: "مشرف",
    description: "صلاحيات للإشراف على المستخدمين والطلبات.",
    permissions: ["إدارة المستخدمين", "عرض الطلبات"],
  },
  {
    id: 6,
    name: "محلل بيانات",
    description: "صلاحيات لعرض التقارير والإحصائيات.",
    permissions: ["عرض التقارير"],
  },
]; 